app/services/purchase_services/import_file.rb

    def import_csv(file)
      return false if file.blank?

      purchases = []
      ::CSV.foreach(file, col_sep: "\t", headers: true).each do |row|
        purchase = Purchase.create!(row.to_h.transform_keys { |key| key.to_s.tr(' ', '_') })
---
INSERT INTO "purchases" ("purchaser_name", "item_description", "item_price", "purchase_count", "merchant_address", "merchant_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"